app/Models/UserModel.php

    public function validate_login($username, $password){
        $user = $this->where('username', $username)->first();
---
SELECT *
FROM `tb_user`
WHERE `username` = 'mahasiswa'
 LIMIT 1